docs: Use Structurizr for architecture diagrams
